# Obtaining Your Data - Lab

## Introduction
In this lab you'll practice your munging and transforming skills in order to load in your data to solve a regression problem.

## Objectives
You will be able to:
* Perform an ETL process with multiple tables and create a single dataset

## Task Description

You just got hired by Lego! Your first project is going to be to develop a pricing algorithm to help set a target price for new lego sets that are released to market. To do this, you're first going to need to start mining the company database in order to collect the information you need to develop a model.

Start by investigating the database stored in lego.db and joining the tables into a unified dataset!

> **Hint:** use this SQL query to preview the tables in an unknown database:
```sql
SELECT name FROM sqlite_master
            WHERE type='table'
            ORDER BY name;
```

In [ ]:
import sqlite3
import pandas as pd

In [ ]:
con = sqlite3.connect('lego.db')
cur = con.cursor()
cur.execute("""SELECT * FROM sqlite_master
            WHERE type='table'
            ORDER BY name;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
print(df.shape)
df

In [8]:
con = sqlite3.connect('lego.db')
cur = con.cursor()
cur.execute("""SELECT * FROM product_details;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
print(df.shape)
df.head()

(744, 4)

   prod_id prod_desc prod_long_desc theme_name
0      630      blah       blahblah    Classic
1     2304      blah       blahblah     DUPLO®
2     7280      blah       blahblah       City
3     7281      blah       blahblah       City
4     7499      blah       blahblah       City

In [9]:
con = sqlite3.connect('lego.db')
cur = con.cursor()
cur.execute("""SELECT * FROM product_pricing;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
print(df.shape)
df.head()

(10870, 3)

   prod_id country list_price
0    75823      US      29.99
1    75822      US      19.99
2    75821      US      12.99
3    21030      US      99.99
4    21035      US      79.99

In [10]:
con = sqlite3.connect('lego.db')
cur = con.cursor()
cur.execute("""SELECT * FROM product_info;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
print(df.shape)
df.head()

(744, 4)

   prod_id  ages  piece_count                         set_name
0      630    4+            1                  Brick Separator
1     2304  1½-5            1     LEGO® DUPLO® Green Baseplate
2     7280  5-12            2      Straight & Crossroad Plates
3     7281  5-12            2  T-Junction & Curved Road Plates
4     7499  5-12           24     Flexible and Straight Tracks

In [13]:
con = sqlite3.connect('lego.db')
cur = con.cursor()
cur.execute("""SELECT ages, piece_count, list_price
               FROM product_info
               JOIN product_pricing
               USING(prod_id)
               ORDER BY list_price DESC
               ;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
print(df.shape)
df.head()

(10870, 3)

   ages  piece_count list_price
0   12+         1032      99.99
1  6-12          894      99.99
2  7-12          883      99.99
3  6-12          919      99.99
4   16+         1167      99.99

In [14]:
con = sqlite3.connect('lego.db')
cur = con.cursor()
cur.execute("""SELECT *
               FROM product_info
               JOIN product_pricing
               USING(prod_id)
               ORDER BY list_price DESC
               ;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
print(df.shape)
df.head()

(10870, 6)

,prod_id,ages,piece_count,set_name,country,list_price
0,21030,12+,1032,United States Capitol Building,US,99.99
1,60141,6-12,894,Police Station,US,99.99
2,60188,7-12,883,Mining Experts Site,US,99.99
3,60110,6-12,919,Fire Station,US,99.99
4,10252,16+,1167,Volkswagen Beetle,US,99.99

In [ ]:
con = sqlite3.connect('lego.db')
cur = con.cursor()
cur.execute("""SELECT *
               FROM product_info
               JOIN product_pricing
               USING(prod_id)
               JOIN product_details
               USING(prod_id)
               JOIN product_reviews
               USING(prod_id)
               ;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
print(df.shape)
df.head()

## Summary
Nice work! You're working more and more independently through the workflow and ensuring data integrity! In this lab, you successfully executed an ETL process to merge different tables!

In [ ]:
# Their code

In [ ]:
#Preview the tables:
for item in response:
    table = item[0]
    length = c.execute("""SELECT count(*) from {};""".format(table)).fetchall()
    results = c.execute("""SELECT * from {} limit 5;""".format(table)).fetchall()
    df = pd.DataFrame(results)
    df.columns = [x[0] for x in c.description]
    print(table, length, '\n', df, '\n\n')

In [ ]:
df.info()